import React from "react";
import PublicLayout from "../layout/index";
import { Grid, Typography, Box, Paper, Container } from "@mui/material";
function RolesPage() {
  return (
    <PublicLayout>
      <Container
        sx={{
          display: "flex",
          alignItems: "center",
        }}
      >
        <Grid
          component={Paper}
          elevation={5}
          sx={{
            p: { xs: 5, md: 15 },
          }}
          item
          xs={12}
          md={6}
        >
          {" "}
          <Typography variant="h5" mb={4}>
            شرایط و قوانین استفاده از خدمات فروشگاه اینترنتی ایباکس:
          </Typography>
          <Typography mb={4} variant="body1">
            {" "}
            کاربر گرامی لطفاً موارد زیر را جهت استفاده بهینه از خدمات فروشگاه
            اینترنتی ایباکس به دقت ملاحظه فرمایید.
          </Typography>
          <Typography fontWeight={700} mb={1} variant="body1">
            ورود کاربران به فروشگاه اینترنتی ایباکس و ثبت سفارش در هر زمان به
            معنی پذیرفتن کامل کلیه شرایط و قوانین فروشگاه اینترنتی ایباکس از سوی
            کاربر است.
          </Typography>
          <Typography mb={4} variant="body1">
            {" "}
            لازم به ذکر است شرایط و قوانین مندرج، جایگزین کلیه توافق‌های قبلی
            محسوب می‌شود.
          </Typography>
          <Typography mb={2} variant="h6">
            {" "}
            قوانین عمومی:
          </Typography>
          <Typography mb={5} variant="body2">
            {" "}
            توجه داشته باشید کلیه اصول و رویه‏‌های فروشگاه اینترنتی ایباکس منطبق
            با قوانین جمهوری اسلامی ایران، قانون تجارت الکترونیک و قانون حمایت
            از حقوق مصرف کننده است و متعاقبا کاربر نیز موظف به رعایت قوانین
            مرتبط با کاربر است. در صورتی که در قوانین مندرج، رویه‏‌ها و خدمات
            فروشگاه اینترنتی ایباکس تغییراتی در آینده ایجاد شود، در همین صفحه
            منتشر و به روز رسانی می شود و شما توافق می‏‌کنید که استفاده مستمر
            شما از سایت به معنی پذیرش هرگونه تغییر است.
          </Typography>
          <Typography mb={2} variant="body1">
            تعریف مشتری یا کاربر:
          </Typography>
          <Typography mb={5} variant="body2">
            مشتری یا کاربر به شخصی گفته می‌شود که با اطلاعات کاربری خود که در
            فرم ثبت نام درج کرده است، به ثبت سفارش یا هرگونه استفاده از خدمات
            فروشگاه اینترنتی ایباکس اقدام نماید.
          </Typography>
          <Typography mb={2} variant="body1">
            {" "}
            ارتباطات الکترونیکی:
          </Typography>
          <Typography mb={5} variant="body2">
            {" "}
            هنگامی که شما از خدمات فروشگاه اینترنتی ایباکس استفاده می‏‌کنید،
            سفارش اینترنتی خود را ثبت یا خرید می‏‌کنید و یا به فروشگاه اینترنتی
            ایباکس ایمیل می‏‌زنید، این ارتباطات به صورت الکترونیکی انجام می‏‌شود
            و در صورتی که درخواست شما با رعایت کلیه اصول و رویه‏‌ها باشد، شما
            موافقت می‌‏کنید که فروشگاه اینترنتی ایباکس به صورت الکترونیکی (از
            طریق تماس، پست الکترونیکی، سرویس پیام کوتاه ) به درخواست شما پاسخ
            دهد.
          </Typography>
          <Typography mb={2} variant="body1">
            سیاست‏‌های رعایت حریم شخصی:
          </Typography>
          <Typography mb={5} variant="body2">
            فروشگاه اینترنتی ایباکس به اطلاعات خصوصی اشخاصى که از خدمات سایت
            استفاده می‏‌کنند، احترام گذاشته و از آن محافظت می‏‌کند. فروشگاه
            اینترنتی ایباکس متعهد می‏‌شود در حد توان از حریم شخصی شما دفاع کند و
            در این راستا، تکنولوژی مورد نیاز برای هرچه مطمئن‏‌تر و امن‏‌تر شدن
            استفاده شما از سایت را، توسعه دهد. در واقع با استفاده از سایت
            فروشگاه اینترنتی ایباکس، شما رضایت خود را از این سیاست نشان
            می‏‌دهید. همه مطالب در دسترس از طریق هر یک از خدمات فروشگاه اینترنتی
            ایباکس، مانند لوگو، علائم تجاری، متن، توضیحات، گرافیک، آرم، تصاویر و
            کپی، داده‌ها و کلیه محتوای تولید شده توسط فروشگاه اینترنتی ایباکس
            جزئی از اموال فروشگاه اینترنتی ایباکس محسوب می‏‌شود و حق استفاده و
            نشر تمامی مطالب موجود و در دسترس در انحصار فروشگاه اینترنتی ایباکس
            است و هرگونه استفاده بدون کسب مجوز کتبی، حق پیگرد قانونی را برای
            فروشگاه اینترنتی ایباکس محفوظ می‏‌دارد.
          </Typography>
          <Typography mb={2} variant="body1">
            ثبت، پردازش و ارسال سفارش:
          </Typography>
          <Typography mb={5} variant="body2">
            روز کاری به معنی روز شنبه تا پنج شنبه هر هفته، به استثنای تعطیلات
            عمومی در ایران است و کلیه سفارش‏‌های ثبت شده در طول روزهای کاری و
            اولین روز پس از تعطیلات پردازش می‌‏شوند. فروشگاه اینترنتی ایباکس به
            مشتریان خود در ۷ روز هفته و ۲۴ ساعت در روز امکان ثبت سفارش می‌‏دهد
            ولیکن از ساعت 8 صبح الی ۱۸ هر روز امکان پاسخگویی و پیگیری ارسال
            سفارشات میباشد. کلیه سفارش‌‏های ثبت شده در سایت فروشگاه اینترنتی
            ایباکس به وسیله ارسال پیش فاکتور از طریق پشتیبانی، در صف پردازش قرار
            می‏‌گیرند فروشگاه اینترنتی ایباکس همواره در ارسال و تحویل کلیه
            سفارش‌‏های ثبت شده، نهایت دقت و تلاش خود را می‏‌نماید. با وجود این،
            در صورتی که موجودی محصولی در فروشگاه اینترنتی ایباکس به پایان برسد و
            یا قیمت محصول مورد نظر به روز نباشد حتی پس از اقدام مشتری به
            سفارش‌‏گذاری، حق کنسل کردن آن سفارش و یا استرداد وجه سفارش برای
            فروشگاه اینترنتی ایباکس محفوظ است و یا مشتری می‏‌تواند به جای کالای
            سفارش داده شده محصول دیگری را جایگزین کند و یا مابه التفاوت وجه
            محصول را به فروشگاه ایباکس پرداخت نماید. فروشگاه اینترنتی ایباکس
            مجاز است بدون اطلاع قبلی نسبت به توقف سفارش‌‏گیری جدید، اقدام و فروش
            خود را متوقف کند و کلیه سفارش‌‏های ثبت شده قبل از توقف سفارش‌‏گیری،
            پردازش و ارسال می‌‏شود. حق قطع فروش کلیه و یا بخشی از محصولات به هر
            دلیلی مانند اتمام موجودی کالا بدون اطلاع قبلی، برای فروشگاه اینترنتی
            ایباکس محفوظ است.
          </Typography>
        </Grid>
      </Container>
    </PublicLayout>
  );
}

export default RolesPage;
